nxp-mcuxpresso/mcux-sdk/devices/LPC54S018/LPC54S018.h
#define ADC_CALIB_CALIB_MASK                     (0x1U)
#define ADC_CALIB_CALIB_SHIFT                    (0U)
/*! CALIB - Calibration request. Setting this bit will launch an ADC calibration cycle. This bit can
 *    only be set to a '1' by software. It is cleared automatically when the calibration cycle
 *    completes.
 */
#define ADC_CALIB_CALIB(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_CALIB_CALIB_SHIFT)) & ADC_CALIB_CALIB_MASK)

#define ADC_CALIB_CALREQD_MASK                   (0x2U)
#define ADC_CALIB_CALREQD_SHIFT                  (1U)
/*! CALREQD - Calibration required. This read-only bit indicates if calibration is required when
 *    enabling the ADC. CALREQD will be '1' if no calibration has been run since the chip was
 *    powered-up and if the BYPASSCAL bit in the CTRL register is low. Software will test this bit to
 *    determine whether to initiate a calibration cycle or whether to set the ADC_INIT bit (in the STARTUP
 *    register) to launch the ADC initialization process which includes a 'dummy' conversion cycle.
 *    Note: A 'dummy' conversion cycle requires approximately 6 ADC clocks as opposed to 81 clocks
 *    required for calibration.
 */
#define ADC_CALIB_CALREQD(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_CALIB_CALREQD_SHIFT)) & ADC_CALIB_CALREQD_MASK)

#define ADC_CALIB_CALVALUE_MASK                  (0x1FCU)
#define ADC_CALIB_CALVALUE_SHIFT                 (2U)
/*! CALVALUE - Calibration Value. This read-only field displays the calibration value established
 *    during last calibration cycle. This value is not typically of any use to the user.
 */
#define ADC_CALIB_CALVALUE(x)                    (((uint32_t)(((uint32_t)(x)) << ADC_CALIB_CALVALUE_SHIFT)) & ADC_CALIB_CALVALUE_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group ADC_Register_Masks */


/* ADC - Peripheral instance base addresses */
/** Peripheral ADC0 base address */
#define ADC0_BASE                                (0x400A0000u)
/** Peripheral ADC0 base pointer */
#define ADC0                                     ((ADC_Type *)ADC0_BASE)
/** Array initializer of ADC peripheral base addresses */
#define ADC_BASE_ADDRS                           { ADC0_BASE }
/** Array initializer of ADC peripheral base pointers */
#define ADC_BASE_PTRS                            { ADC0 }
/** Interrupt vectors for the ADC peripheral type */
#define ADC_SEQ_IRQS                             { ADC0_SEQA_IRQn, ADC0_SEQB_IRQn }
#define ADC_THCMP_IRQS                           { ADC0_THCMP_IRQn }

/*!
 * @}
 */ /* end of group ADC_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- AES Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup AES_Peripheral_Access_Layer AES Peripheral Access Layer
 * @{
 */

/** AES - Register Layout Typedef */
typedef struct {
  union {                                          /* offset: 0x0 */
    __IO uint32_t CFG;                               /**< AES Configuration register, offset: 0x0 */
    struct {                                         /* offset: 0x0 */
      union {                                          /* offset: 0x0 */
        __IO uint16_t CFG0_15;                           /**< AES Configuration register 0:15, offset: 0x0 */
        struct {                                         /* offset: 0x0 */
          __IO uint8_t CFG0_7;                             /**< AES Configuration register 0:7, offset: 0x0 */
          __IO uint8_t CFG8_15;                            /**< AES Configuration register 8:15, offset: 0x1 */
        } CFGL;
      };
      __IO uint16_t CFG16_31;                          /**< AES Configuration register 16:31, offset: 0x2 */
    } CFG0_32;
  };
  __IO uint32_t CMD;                               /**< AES Command register, offset: 0x4 */
  __IO uint32_t STAT;                              /**< AES Status register, offset: 0x8 */
  __IO uint32_t CTR_INCR;                          /**< Counter Increment, offset: 0xC */
       uint8_t RESERVED_0[16];
  __O  uint32_t KEY[8];                            /**< Bits of the AES key, array offset: 0x20, array step: 0x4 */
  __O  uint32_t INTEXT[4];                         /**< Input text bits, array offset: 0x40, array step: 0x4 */
  __O  uint32_t HOLDING[4];                        /**< Holding register bits, array offset: 0x50, array step: 0x4 */
  __I  uint32_t OUTTEXT[4];                        /**< Output text bits, array offset: 0x60, array step: 0x4 */
  __O  uint32_t GF128_Y[4];                        /**< Y bits input of GF128 hash, array offset: 0x70, array step: 0x4 */
  __I  uint32_t GF128_Z[4];                        /**< Result bits of GF128 hash, array offset: 0x80, array step: 0x4 */
  __I  uint32_t GCM_TAG[4];                        /**< GCM Tag bits, array offset: 0x90, array step: 0x4 */
} AES_Type;

/* ----------------------------------------------------------------------------
   -- AES Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup AES_Register_Masks AES Register Masks
 * @{
 */

/*! @name CFG - AES Configuration register */
/*! @{ */

#define AES_CFG_PROC_EN_MASK                     (0x3U)
#define AES_CFG_PROC_EN_SHIFT                    (0U)
/*! PROC_EN - Process type enable.
 */
#define AES_CFG_PROC_EN(x)                       (((uint32_t)(((uint32_t)(x)) << AES_CFG_PROC_EN_SHIFT)) & AES_CFG_PROC_EN_MASK)

#define AES_CFG_GF128_SEL_MASK                   (0x4U)
#define AES_CFG_GF128_SEL_SHIFT                  (2U)
/*! GF128_SEL - GF128 hash selection.
 */
#define AES_CFG_GF128_SEL(x)                     (((uint32_t)(((uint32_t)(x)) << AES_CFG_GF128_SEL_SHIFT)) & AES_CFG_GF128_SEL_MASK)

#define AES_CFG_INTEXT_BSWAP_MASK                (0x10U)
#define AES_CFG_INTEXT_BSWAP_SHIFT               (4U)
/*! INTEXT_BSWAP - Byte swap input text.
 */
#define AES_CFG_INTEXT_BSWAP(x)                  (((uint32_t)(((uint32_t)(x)) << AES_CFG_INTEXT_BSWAP_SHIFT)) & AES_CFG_INTEXT_BSWAP_MASK)

#define AES_CFG_INTEXT_WSWAP_MASK                (0x20U)
#define AES_CFG_INTEXT_WSWAP_SHIFT               (5U)
/*! INTEXT_WSWAP - Word swap input text.
 */
#define AES_CFG_INTEXT_WSWAP(x)                  (((uint32_t)(((uint32_t)(x)) << AES_CFG_INTEXT_WSWAP_SHIFT)) & AES_CFG_INTEXT_WSWAP_MASK)

#define AES_CFG_OUTTEXT_BSWAP_MASK               (0x40U)
#define AES_CFG_OUTTEXT_BSWAP_SHIFT              (6U)
/*! OUTTEXT_BSWAP - Byte swap output text.
 */
#define AES_CFG_OUTTEXT_BSWAP(x)                 (((uint32_t)(((uint32_t)(x)) << AES_CFG_OUTTEXT_BSWAP_SHIFT)) & AES_CFG_OUTTEXT_BSWAP_MASK)

#define AES_CFG_OUTTEXT_WSWAP_MASK               (0x80U)
#define AES_CFG_OUTTEXT_WSWAP_SHIFT              (7U)
/*! OUTTEXT_WSWAP - Word swap output text.
 */
#define AES_CFG_OUTTEXT_WSWAP(x)                 (((uint32_t)(((uint32_t)(x)) << AES_CFG_OUTTEXT_WSWAP_SHIFT)) & AES_CFG_OUTTEXT_WSWAP_MASK)

#define AES_CFG_KEY_CFG_MASK                     (0x300U)
#define AES_CFG_KEY_CFG_SHIFT                    (8U)
/*! KEY_CFG - Key Configuration.
 */
#define AES_CFG_KEY_CFG(x)                       (((uint32_t)(((uint32_t)(x)) << AES_CFG_KEY_CFG_SHIFT)) & AES_CFG_KEY_CFG_MASK)

#define AES_CFG_INBLK_SEL_MASK                   (0x30000U)
#define AES_CFG_INBLK_SEL_SHIFT                  (16U)
/*! INBLK_SEL - Input block select.
 */
#define AES_CFG_INBLK_SEL(x)                     (((uint32_t)(((uint32_t)(x)) << AES_CFG_INBLK_SEL_SHIFT)) & AES_CFG_INBLK_SEL_MASK)

