nxp-mcuxpresso/mcux-sdk/devices/LPC54S018/LPC54S018.h
#define AES_CFG_HOLD_SEL_MASK                    (0x300000U)
#define AES_CFG_HOLD_SEL_SHIFT                   (20U)
/*! HOLD_SEL - Holding register source select.
 */
#define AES_CFG_HOLD_SEL(x)                      (((uint32_t)(((uint32_t)(x)) << AES_CFG_HOLD_SEL_SHIFT)) & AES_CFG_HOLD_SEL_MASK)

#define AES_CFG_OUTTEXT_SEL_MASK                 (0x3000000U)
#define AES_CFG_OUTTEXT_SEL_SHIFT                (24U)
/*! OUTTEXT_SEL - Output text source select.
 */
#define AES_CFG_OUTTEXT_SEL(x)                   (((uint32_t)(((uint32_t)(x)) << AES_CFG_OUTTEXT_SEL_SHIFT)) & AES_CFG_OUTTEXT_SEL_MASK)
/*! @} */

/*! @name CFG0_15 - AES Configuration register 0:15 */
/*! @{ */

#define AES_CFG0_15_PROC_EN_MASK                 (0x3U)
#define AES_CFG0_15_PROC_EN_SHIFT                (0U)
/*! PROC_EN - Process type enable.
 */
#define AES_CFG0_15_PROC_EN(x)                   (((uint16_t)(((uint16_t)(x)) << AES_CFG0_15_PROC_EN_SHIFT)) & AES_CFG0_15_PROC_EN_MASK)

#define AES_CFG0_15_GF128_SEL_MASK               (0x4U)
#define AES_CFG0_15_GF128_SEL_SHIFT              (2U)
/*! GF128_SEL - GF128 hash selection.
 */
#define AES_CFG0_15_GF128_SEL(x)                 (((uint16_t)(((uint16_t)(x)) << AES_CFG0_15_GF128_SEL_SHIFT)) & AES_CFG0_15_GF128_SEL_MASK)

#define AES_CFG0_15_INTEXT_BSWAP_MASK            (0x10U)
#define AES_CFG0_15_INTEXT_BSWAP_SHIFT           (4U)
/*! INTEXT_BSWAP - Byte swap input text.
 */
#define AES_CFG0_15_INTEXT_BSWAP(x)              (((uint16_t)(((uint16_t)(x)) << AES_CFG0_15_INTEXT_BSWAP_SHIFT)) & AES_CFG0_15_INTEXT_BSWAP_MASK)

#define AES_CFG0_15_INTEXT_WSWAP_MASK            (0x20U)
#define AES_CFG0_15_INTEXT_WSWAP_SHIFT           (5U)
/*! INTEXT_WSWAP - Word swap input text.
 */
#define AES_CFG0_15_INTEXT_WSWAP(x)              (((uint16_t)(((uint16_t)(x)) << AES_CFG0_15_INTEXT_WSWAP_SHIFT)) & AES_CFG0_15_INTEXT_WSWAP_MASK)

#define AES_CFG0_15_OUTTEXT_BSWAP_MASK           (0x40U)
#define AES_CFG0_15_OUTTEXT_BSWAP_SHIFT          (6U)
/*! OUTTEXT_BSWAP - Byte swap output text.
 */
#define AES_CFG0_15_OUTTEXT_BSWAP(x)             (((uint16_t)(((uint16_t)(x)) << AES_CFG0_15_OUTTEXT_BSWAP_SHIFT)) & AES_CFG0_15_OUTTEXT_BSWAP_MASK)

#define AES_CFG0_15_OUTTEXT_WSWAP_MASK           (0x80U)
#define AES_CFG0_15_OUTTEXT_WSWAP_SHIFT          (7U)
/*! OUTTEXT_WSWAP - Word swap output text.
 */
#define AES_CFG0_15_OUTTEXT_WSWAP(x)             (((uint16_t)(((uint16_t)(x)) << AES_CFG0_15_OUTTEXT_WSWAP_SHIFT)) & AES_CFG0_15_OUTTEXT_WSWAP_MASK)

#define AES_CFG0_15_KEY_CFG_MASK                 (0x300U)
#define AES_CFG0_15_KEY_CFG_SHIFT                (8U)
/*! KEY_CFG - Key Configuration.
 */
#define AES_CFG0_15_KEY_CFG(x)                   (((uint16_t)(((uint16_t)(x)) << AES_CFG0_15_KEY_CFG_SHIFT)) & AES_CFG0_15_KEY_CFG_MASK)
/*! @} */

/*! @name CFG0_7 - AES Configuration register 0:7 */
/*! @{ */

#define AES_CFG0_7_PROC_EN_MASK                  (0x3U)
#define AES_CFG0_7_PROC_EN_SHIFT                 (0U)
/*! PROC_EN - Process type enable.
 */
#define AES_CFG0_7_PROC_EN(x)                    (((uint8_t)(((uint8_t)(x)) << AES_CFG0_7_PROC_EN_SHIFT)) & AES_CFG0_7_PROC_EN_MASK)

#define AES_CFG0_7_GF128_SEL_MASK                (0x4U)
#define AES_CFG0_7_GF128_SEL_SHIFT               (2U)
/*! GF128_SEL - GF128 hash selection.
 */
#define AES_CFG0_7_GF128_SEL(x)                  (((uint8_t)(((uint8_t)(x)) << AES_CFG0_7_GF128_SEL_SHIFT)) & AES_CFG0_7_GF128_SEL_MASK)

#define AES_CFG0_7_INTEXT_BSWAP_MASK             (0x10U)
#define AES_CFG0_7_INTEXT_BSWAP_SHIFT            (4U)
/*! INTEXT_BSWAP - Byte swap input text.
 */
#define AES_CFG0_7_INTEXT_BSWAP(x)               (((uint8_t)(((uint8_t)(x)) << AES_CFG0_7_INTEXT_BSWAP_SHIFT)) & AES_CFG0_7_INTEXT_BSWAP_MASK)

#define AES_CFG0_7_INTEXT_WSWAP_MASK             (0x20U)
#define AES_CFG0_7_INTEXT_WSWAP_SHIFT            (5U)
/*! INTEXT_WSWAP - Word swap input text.
 */
#define AES_CFG0_7_INTEXT_WSWAP(x)               (((uint8_t)(((uint8_t)(x)) << AES_CFG0_7_INTEXT_WSWAP_SHIFT)) & AES_CFG0_7_INTEXT_WSWAP_MASK)

#define AES_CFG0_7_OUTTEXT_BSWAP_MASK            (0x40U)
#define AES_CFG0_7_OUTTEXT_BSWAP_SHIFT           (6U)
/*! OUTTEXT_BSWAP - Byte swap output text.
 */
#define AES_CFG0_7_OUTTEXT_BSWAP(x)              (((uint8_t)(((uint8_t)(x)) << AES_CFG0_7_OUTTEXT_BSWAP_SHIFT)) & AES_CFG0_7_OUTTEXT_BSWAP_MASK)

#define AES_CFG0_7_OUTTEXT_WSWAP_MASK            (0x80U)
#define AES_CFG0_7_OUTTEXT_WSWAP_SHIFT           (7U)
/*! OUTTEXT_WSWAP - Word swap output text.
 */
#define AES_CFG0_7_OUTTEXT_WSWAP(x)              (((uint8_t)(((uint8_t)(x)) << AES_CFG0_7_OUTTEXT_WSWAP_SHIFT)) & AES_CFG0_7_OUTTEXT_WSWAP_MASK)
/*! @} */

/*! @name CFG8_15 - AES Configuration register 8:15 */
/*! @{ */

#define AES_CFG8_15_KEY_CFG_MASK                 (0x3U)
#define AES_CFG8_15_KEY_CFG_SHIFT                (0U)
/*! KEY_CFG - Key Configuration.
 */
#define AES_CFG8_15_KEY_CFG(x)                   (((uint8_t)(((uint8_t)(x)) << AES_CFG8_15_KEY_CFG_SHIFT)) & AES_CFG8_15_KEY_CFG_MASK)
/*! @} */

/*! @name CFG16_31 - AES Configuration register 16:31 */
/*! @{ */

#define AES_CFG16_31_INBLK_SEL_MASK              (0x3U)
#define AES_CFG16_31_INBLK_SEL_SHIFT             (0U)
/*! INBLK_SEL - Input block select.
 */
#define AES_CFG16_31_INBLK_SEL(x)                (((uint16_t)(((uint16_t)(x)) << AES_CFG16_31_INBLK_SEL_SHIFT)) & AES_CFG16_31_INBLK_SEL_MASK)

#define AES_CFG16_31_HOLD_SEL_MASK               (0x30U)
#define AES_CFG16_31_HOLD_SEL_SHIFT              (4U)
/*! HOLD_SEL - Holding register source select.
 */
#define AES_CFG16_31_HOLD_SEL(x)                 (((uint16_t)(((uint16_t)(x)) << AES_CFG16_31_HOLD_SEL_SHIFT)) & AES_CFG16_31_HOLD_SEL_MASK)

#define AES_CFG16_31_OUTTEXT_SEL_MASK            (0x300U)
#define AES_CFG16_31_OUTTEXT_SEL_SHIFT           (8U)
/*! OUTTEXT_SEL - Output text source select.
 */
#define AES_CFG16_31_OUTTEXT_SEL(x)              (((uint16_t)(((uint16_t)(x)) << AES_CFG16_31_OUTTEXT_SEL_SHIFT)) & AES_CFG16_31_OUTTEXT_SEL_MASK)
/*! @} */

/*! @name CMD - AES Command register */
/*! @{ */

#define AES_CMD_COPY_TO_Y_MASK                   (0x2U)
#define AES_CMD_COPY_TO_Y_SHIFT                  (1U)
/*! COPY_TO_Y - Copy output text to GF128Y.
 */
#define AES_CMD_COPY_TO_Y(x)                     (((uint32_t)(((uint32_t)(x)) << AES_CMD_COPY_TO_Y_SHIFT)) & AES_CMD_COPY_TO_Y_MASK)

#define AES_CMD_SWITCH_MODE_MASK                 (0x10U)
#define AES_CMD_SWITCH_MODE_SHIFT                (4U)
/*! SWITCH_MODE - When this bit is set the mode switches from forward mode (encryption) to reverse
 *    mode (decryption) or reverse mode to forward mode.
 */
#define AES_CMD_SWITCH_MODE(x)                   (((uint32_t)(((uint32_t)(x)) << AES_CMD_SWITCH_MODE_SHIFT)) & AES_CMD_SWITCH_MODE_MASK)

#define AES_CMD_ABORT_MASK                       (0x100U)
#define AES_CMD_ABORT_SHIFT                      (8U)
/*! ABORT - Aborts Encrypt/Decrypt and GF128 Hash operation.
 */
#define AES_CMD_ABORT(x)                         (((uint32_t)(((uint32_t)(x)) << AES_CMD_ABORT_SHIFT)) & AES_CMD_ABORT_MASK)

#define AES_CMD_WIPE_MASK                        (0x200U)
#define AES_CMD_WIPE_SHIFT                       (9U)
/*! WIPE - When set this bit performs abort, clears KEY and GF128_Y registers and disables cipher.
 */
#define AES_CMD_WIPE(x)                          (((uint32_t)(((uint32_t)(x)) << AES_CMD_WIPE_SHIFT)) & AES_CMD_WIPE_MASK)
/*! @} */

/*! @name STAT - AES Status register */
/*! @{ */

#define AES_STAT_IDLE_MASK                       (0x1U)
#define AES_STAT_IDLE_SHIFT                      (0U)
/*! IDLE - AES engine Idle.
 */
#define AES_STAT_IDLE(x)                         (((uint32_t)(((uint32_t)(x)) << AES_STAT_IDLE_SHIFT)) & AES_STAT_IDLE_MASK)

#define AES_STAT_IN_READY_MASK                   (0x2U)
#define AES_STAT_IN_READY_SHIFT                  (1U)
/*! IN_READY - Input text ready.
 */
#define AES_STAT_IN_READY(x)                     (((uint32_t)(((uint32_t)(x)) << AES_STAT_IN_READY_SHIFT)) & AES_STAT_IN_READY_MASK)

#define AES_STAT_OUT_READY_MASK                  (0x4U)
#define AES_STAT_OUT_READY_SHIFT                 (2U)
/*! OUT_READY - Output text ready.
 */
#define AES_STAT_OUT_READY(x)                    (((uint32_t)(((uint32_t)(x)) << AES_STAT_OUT_READY_SHIFT)) & AES_STAT_OUT_READY_MASK)

